IRP/src/Documents/ProductionPlanningCorrection/ProductionPlanningCorrection.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ProductionPlanningCorrection</name>
  <registerRecords>AccumulationRegister.MF_MaterialPlanning</registerRecords>
  <registerRecords>AccumulationRegister.MF_ProductionPlanning</registerRecords>
  <registerRecords>InformationRegister.MF_BillOfMaterials</registerRecords>
  <registerRecords>AccumulationRegister.MF_DetailingSupplies</registerRecords>
  <registerRecords>InformationRegister.T7010S_BillOfMaterials</registerRecords>
  <registerRecords>AccumulationRegister.R7030T_ProductionPlanning</registerRecords>
  <registerRecords>AccumulationRegister.R7020T_MaterialPlanning</registerRecords>
  <registerRecords>AccumulationRegister.R7010T_DetailingSupplies</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>BusinessUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductionPlanning</name>
    <type>
      <types>DocumentRef.ProductionPlanning</types>
    </type>
  </attributes>
  <attributes>
    <name>PlanningPeriod</name>
    <type>
      <types>CatalogRef.PlanningPeriods</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>CatalogRef.ObjectStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>ApprovedDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Productions</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrentQuantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>BillOfMaterials</name>
      <type>
        <types>CatalogRef.BillOfMaterials</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>BillOfMaterials</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>BusinessUnit</name>
      <type>
        <types>CatalogRef.BusinessUnits</types>
      </type>
    </attributes>
    <attributes>
      <name>ReleaseStore</name>
      <type>
        <types>CatalogRef.Stores</types>
      </type>
    </attributes>
    <attributes>
      <name>MaterialStore</name>
      <type>
        <types>CatalogRef.Stores</types>
      </type>
    </attributes>
    <attributes>
      <name>SemiproductStore</name>
      <type>
        <types>CatalogRef.Stores</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>IsProduct</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>IsSemiproduct</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>IsMaterial</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>IsService</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>InputID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OutputID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UniqueID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PlanningPeriod</name>
      <type>
        <types>CatalogRef.PlanningPeriods</types>
      </type>
    </attributes>
    <attributes>
      <name>BillOfMaterials</name>
      <type>
        <types>CatalogRef.BillOfMaterials</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>BasisUnit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>BasisQuantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>PlannedQuantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>PlannedBasisQuantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Documents/ProductionPlanningCorrection/Forms/DocumentForm/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	MF_FormsServer.DocumentOnCreateAtServer(Object, ThisObject, Cancel, StandardProcessing);
	If Parameters.Key.IsEmpty() Then
		SetFormRules(Object, Object, ThisObject);
		SetCurrentQuantityError(False);
		Items.ProductionPlanningCorrectionExists.Visible = False;		
	EndIf;
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	If Not ValueIsFilled(Object.Ref) 
		And Not ValueIsFilled(Object.PlanningPeriod) Then
		NewPlanningPeriod = MF_FormsServer.GetPlanningPeriod(Object.Date, Object.BusinessUnit);
		If NewPlanningPeriod <> Object.PlanningPeriod Then
			Object.PlanningPeriod = NewPlanningPeriod;
			MF_FormsClient.SetDocumentProductionPlanning(Object);
		EndIf;
	EndIf;
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)
	MF_FormsServer.DocumentAfterWriteAtServer(Object, ThisObject, CurrentObject, WriteParameters);
	SetFormRules(Object, Object, ThisObject);
	SetCurrentQuantityError(Not IsCurrentQuantityActual());
EndProcedure

&AtServer
Procedure OnReadAtServer(CurrentObject)
	ThisObject.ProductionPlanningClosing = MF_FormsServer.GetProductionPlanningColosing(CurrentObject.ProductionPlanning);
	MF_FormsServer.DocumentOnReadAtServer(Object, ThisObject, CurrentObject);
	SetFormRules(Object, Object, ThisObject);
	SetCurrentQuantityError(Not IsCurrentQuantityActual());
	ThisObject.ReadOnly = GetReadOnly();
EndProcedure

&AtServer
Function GetReadOnly()
	If Not Object.Status.Posting Then
		Return False;
	EndIf;
	Query = New Query();
	Query.Text = 
	"SELECT TOP 1
	|	MF_ProductionPlanningCorrection.Ref
	|FROM
	|	Document.MF_ProductionPlanningCorrection AS MF_ProductionPlanningCorrection
	|WHERE
	|	NOT MF_ProductionPlanningCorrection.DeletionMark
	|	AND MF_ProductionPlanningCorrection.Posted
	|	AND MF_ProductionPlanningCorrection.ProductionPlanning = &ProductionPlanning
	|	AND MF_ProductionPlanningCorrection.Ref <> &Ref
	|	AND MF_ProductionPlanningCorrection.ApprovedDate > &ApprovedDate
	|ORDER BY
	|	MF_ProductionPlanningCorrection.ApprovedDate";
	Query.SetParameter("Ref", Object.Ref);
	Query.SetParameter("ApprovedDate", Object.ApprovedDate);
	Query.SetParameter("ProductionPlanning", Object.ProductionPlanning);
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	IsReadOnly = False;
	If QuerySelection.Next() Then
		ThisObject.ProductionPlanningCorrectionExists = QuerySelection.Ref;
		Items.ProductionPlanningCorrectionExists.Visible =  True;
		IsReadOnly = True;
	Else
		Items.ProductionPlanningCorrectionExists.Visible = False;
	EndIf;
	Return IsReadOnly Or ValueIsFilled(ThisObject.ProductionPlanningClosing);
EndFunction

&AtClientAtServerNoContext
Procedure SetFormRules(Object, CurrentObject, Form)
	MF_FormsClientServer.DocumentSetFormRules(Object, CurrentObject, Form);
	Form.Items.GroupHead.Visible = ValueIsFilled(Form.ProductionPlanningClosing);
EndProcedure

&AtClient
Procedure DescriptionClick(Item, StandardProcessing)
	DocumentsClient.DescriptionClick(Object, ThisObject, Item, StandardProcessing);
EndProcedure

#Region Productions

&AtClient
Procedure ProductionsOnChange(Item)
	MF_FormsClient.FillRowIDInTable(Object, ThisObject, "Productions");
EndProcedure

&AtClient
Procedure ProductionsAfterDeleteRow(Item)
	MF_FormsClient.ClearDependedTables(Object, ThisObject, "Productions", "BillOfMaterials");
EndProcedure

&AtClient
Procedure ProductionsItemStartChoice(Item, ChoiceData, StandardProcessing)
	MF_FormsClient.ItemStartChoice(Object, ThisObject, Item, ChoiceData, StandardProcessing);
EndProcedure

&AtClient
Procedure ProductionsItemEditTextChange(Item, Text, StandardProcessing)
	MF_FormsClient.ItemEditTextChange(Object, ThisObject, Item, Text, StandardProcessing);
EndProcedure

&AtClient
Procedure ProductionsItemOnChange(Item)
	MF_FormsClient.ItemOnChange(Object, ThisObject, Item, "Productions");
	UpdateCurrentQuantityByRow();
EndProcedure

&AtClient
Procedure ProductionsUnitOnChange(Item)
	UpdateCurrentQuantityByRow();
EndProcedure

&AtClient
Procedure ProductionsQuantityOnChange(Item)
	UpdateCurrentQuantityByRow();
EndProcedure

&AtClient
Procedure ProductionsItemKeyOnChange(Item)
	MF_FormsClient.ItemKeyOnChange(Object, ThisObject, Item, "Productions");
	UpdateCurrentQuantityByRow();
EndProcedure

&AtClient
Procedure ProductionsBillOfMaterialsOnChange(Item)
	UpdateCurrentQuantityByRow();
EndProcedure

&AtClient
Procedure ProductionsBillOfMaterialsStartChoice(Item, ChoiceData, StandardProcessing)
	StandardProcessing = False;
	CurrentData = Items.Productions.CurrentData;
	If CurrentData = Undefined Then
		Return;
	EndIf;
	Filters = New Array();
	Filters.Add(DocumentsClientServer.CreateFilterItem("Item"    , CurrentData.Item, DataCompositionComparisonType.Equal));
	Filters.Add(DocumentsClientServer.CreateFilterItem("ItemKey" , CurrentData.ItemKey, DataCompositionComparisonType.Equal));
	
	MF_FormsClient.BillOfMaterialsStartChoice(Object, ThisObject, Item, ChoiceData, StandardProcessing, Filters);
EndProcedure

&AtClient
Procedure ProductionsBillOfMaterialsEditTextChange(Item, Text, StandardProcessing)
	StandardProcessing = False;
	CurrentData = Items.Productions.CurrentData;
	If CurrentData = Undefined Then
		Return;
	EndIf;
	Filters = New Array();
	Filters.Add(DocumentsClientServer.CreateFilterItem("Item"    , CurrentData.Item, DataCompositionComparisonType.Equal));
	Filters.Add(DocumentsClientServer.CreateFilterItem("ItemKey" , CurrentData.ItemKey, DataCompositionComparisonType.Equal));
	
	MF_FormsClient.BillOfMaterialsEditTextChange(Object, ThisObject, Item, Text, StandardProcessing, Filters);
EndProcedure

#EndRegion

#Region GroupTitleDecorations

&AtClient
Procedure GroupTitleCollapsedClick(Item)
	DocumentsClientServer.ChangeTitleCollapse(Object, ThisObject, True);
EndProcedure

&AtClient
Procedure GroupTitleUncollapsedClick(Item)
	DocumentsClientServer.ChangeTitleCollapse(Object, ThisObject, False);
EndProcedure

#EndRegion

&AtClient
Procedure CompanyOnChange(Item)
	MF_FormsClient.SetDocumentProductionPlanning(Object);
	UpdateCurrentQuantityByTable();
EndProcedure

&AtClient
Procedure BusinessUnitOnChange(Item)
	MF_FormsClient.ChangePlanningPeriodWithQuestion(Object);
	UpdateCurrentQuantityByTable();
EndProcedure

&AtClient
Procedure PlanningPeriodOnChange(Item)
	MF_FormsClient.SetDocumentProductionPlanning(Object);
	UpdateCurrentQuantityByTable();
EndProcedure

&AtClient
Procedure DateOnChange(Item)
	MF_FormsClient.ChangePlanningPeriodWithQuestion(Object);
	UpdateCurrentQuantityByTable();
EndProcedure

&AtServer
Procedure SetCurrentQuantityError(IsError)
	If ValueIsFilled(Object.ApprovedDate) Then
		Items.PictureCurrentQuantittyError.Visible = False;
		Items.LabelCurrentQuantityError.Visible = False;
		Items.UpdateCurrentQuantity.Visible = False;
	Else		
		Items.PictureCurrentQuantittyError.Visible = IsError;
		Items.LabelCurrentQuantityError.Visible = IsError;
		Items.UpdateCurrentQuantity.Visible = IsError;
	EndIf;
EndProcedure

&AtClient
Procedure UpdateCurrentQuantityByRow()
	CurrentData = Items.Productions.CurrentData;
	If CurrentData = Undefined Then
		Return;
	EndIf;
	
	CurrentQuantityInfo = GetCurrentQuantity(Object.Company,
											 Object.ProductionPlanning, 
											 Object.PlanningPeriod, 
											 CurrentData.BillOfMaterials,
											 CurrentData.ItemKey);
	If ValueIsFilled(CurrentQuantityInfo.BasisQuantity) Then
		CurrentData.Unit = CurrentQuantityInfo.BasisUnit;
	EndIf;
	CurrentData.CurrentQuantity = CurrentQuantityInfo.BasisQuantity;
	MF_FormsClient.FillBillOfMaterialTableCorrection(Object, ThisObject, CurrentData);
EndProcedure

&AtServer
Procedure UpdateCurrentQuantityByTable()
	For Each Row In Object.Productions Do
		CurrentQuantityInfo = GetCurrentQuantity(Object.Company,
												 Object.ProductionPlanning, 
												 Object.PlanningPeriod,
												 Row.BillOfMaterials,
												 Row.ItemKey);
		If ValueIsFilled(CurrentQuantityInfo.BasisQuantity) Then
			Row.Unit = CurrentQuantityInfo.BasisUnit;
		EndIf;
		Row.CurrentQuantity = CurrentQuantityInfo.BasisQuantity;
		MF_FormsClientServer.FillBillOfMaterialTableCorrection(Object, Row);
	EndDo;
	SetCurrentQuantityError(False);
EndProcedure

&AtClient
Procedure ShowRowKey(Command)
	MF_FormsClient.ShowRowKey(ThisObject);
EndProcedure


&AtServer
Function IsCurrentQuantityActual()
	For Each Row In Object.Productions Do
		CurrentQuantityInfo = GetCurrentQuantity(Object.Company,
												 Object.ProductionPlanning,
												 Object.PlanningPeriod, 
												 Row.BillOfMaterials,
												 Row.ItemKey);

		CurrentQunatity = ?(ValueIsFilled(Row.CurrentQuantity), Row.CurrentQuantity, 0);
		ActualQuantity  = ?(ValueIsFilled(CurrentQuantityInfo.BasisQuantity), CurrentQuantityInfo.BasisQuantity, 0);
				
		If CurrentQunatity <> ActualQuantity Then
			Return False;
		EndIf;	
	EndDo;
	Return True;
EndFunction

&AtServerNoContext
Function GetCurrentQuantity(Company, ProductionPlanning, PlanningPeriod, BillOfMaterials, ItemKey)
	Return Documents.MF_ProductionPlanningCorrection.GetCurrentQuantity(Company,
																		ProductionPlanning,
																		PlanningPeriod,  
	                                                                    BillOfMaterials,
	                                                                    ItemKey);
EndFunction

&AtClient
Procedure StatusHistoryClick(Item)
	MF_ObjectStatusesClient.OpenHistoryByStatus(Object.Ref, ThisObject);
EndProcedure

&AtClient
Procedure UpdateCurrentQuantity(Command)
	UpdateCurrentQuantityByTable();
EndProcedure

&AtClient
Procedure ProductionsSelection(Item, RowSelected, Field, StandardProcessing)
	If Not ThisObject.ReadOnly Then
		Return;
	EndIf;
	CurrentData = Items.Productions.CurrentData;
	If CurrentData = Undefined Then
		Return;
	EndIf;
	MF_FormsClient.OpenObjectForm(Field, "ProductionsItem", CurrentData.Item, StandardProcessing);
	MF_FormsClient.OpenObjectForm(Field, "ProductionsItemKey", CurrentData.ItemKey, StandardProcessing);
	MF_FormsClient.OpenObjectForm(Field, "ProductionsUnit", CurrentData.Unit, StandardProcessing);
	MF_FormsClient.OpenObjectForm(Field, "ProductionsBillOfMaterials", CurrentData.BillOfMaterials, StandardProcessing);
EndProcedure

&AtClient
Procedure EditStores(Command)
		CurrentData = Items.Productions.CurrentData;
	If CurrentData = Undefined Then 
		Return;
	EndIf;
	FormParameters = MF_FormsClient.GetEditStoresParameters(CurrentData, Object);
	FormParameters.Insert("ReadOnlyStores", ValueIsFilled(CurrentData.CurrentQuantity) Or ThisObject.ReadOnly);
	NotifyParameters = New Structure();
	NotifyParameters.Insert("Object", Object);
	NotifyParameters.Insert("Form"  , ThisObject);
	Notify = New NotifyDescription("EditStoresContinue", MF_FormsClient, NotifyParameters);
	OpenForm("CommonForm.MF_EditStores", FormParameters, ThisObject, , , , Notify , FormWindowOpeningMode.LockOwnerWindow);
EndProcedure
